---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.ForwardIterator
source: html/93cc0950-151f-1c14-776a-5b8a718e1fd4.htm
---
# Autodesk.Revit.DB.DetailCurveArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual DetailCurveArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.